source/_posts/2014-05-05-浅谈设计模式附录一.markdown
---
layout: post
title: "浅谈设计模式附录一: 标识"
date: 2014-05-05
comments: true
categories: [Design Pattern]
tags: [Design Pattern, C++]
---


<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 类图</h2>
<div class="outline-text-2" id="text-1">
{% img /images/blog/2014/appendix/class_relationships.svg %}

<ol class="org-ol">
<li>实例化
</li>
</ol>
{% img /images/blog/2014/appendix/instantiate.jpeg %}

<p>
CreateTool创建LineShape对象。
</p>

<!-- more -->

<ol class="org-ol">
<li>继承
</li>
</ol>
{% img /images/blog/2014/appendix/subclass.jpeg %}

<p>
类LineShape是继承父类Shape.
</p>

<ol class="org-ol">
<li>委托
</li>
</ol>
{% img /images/blog/2014/appendix/delegation.jpeg %}

<p>
委托是组合的一种方法，使组合具有继承的复用功能。LineShape保持Color对象的一个引用，当LineShape做一些Color的功能时，它不用从父类继承，它把功能委托给Color来完成。
</p>

<ol class="org-ol">
<li>聚合
</li>
</ol>
{% img /images/blog/2014/appendix/aggregate.jpeg %}

<p>
聚合意味这一个对象拥有另一个对象或对对另一个对象负责。同时意味这一个聚合对象和它的拥有者具有相同的生命周期。
</p>

<ol class="org-ol">
<li>注释
</li>
</ol>
{% img /images/blog/2014/appendix/annotation.svg %}

<p>
右边的框框表示对 <code>Draw()</code> 的注释。
</p>
</div>
</div>
